FSI/fluid-openfoam/0/U
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    object      U;
}

dimensions      [0 1 -1 0 0 0 0];

internalField   uniform (0 0 0);

boundaryField
{
    interface
    {
        type            movingWallVelocity;
        value           uniform (0 0 0);
    }
    inlet
    {
        type            fluxCorrectedVelocity;
    }
    outlet
    {
        type            fluxCorrectedVelocity;
    }
    symmetryXY
    {
        type         symmetry;
    }
    symmetryXZ
    {
        type         symmetry;
    }
    defaultFaces
    {
        type            empty;
    }
}


// ************************************************************************* //
