FSI/fluid-openfoam/0/p
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      p;
}

dimensions      [0 2 -2 0 0 0 0];

internalField   uniform 0;

boundaryField
{	
	inlet
	{
        type            fixedValue;
        value           uniform 100;
	}
	
	outlet
	{
        type            fixedValue;
        value           uniform 0;
	}
	
    symmetryXY
    {
        type         symmetry;
    }
    symmetryXZ
    {
        type         symmetry;
    }

	interface
	{
        type            zeroGradient;
        value           uniform 0;
	}
	
    defaultFaces
    {
        type            empty;
    }
}


// ************************************************************************* //
