FSI/fluid-openfoam/0/pd
/*--------------------------------*- C++ -*----------------------------------*\
| solids4foam: solid mechanics and fluid-solid interaction simulations        |
| Version:     v2.0                                                           |
| Web:         https://solids4foam.github.io                                  |
| Disclaimer:  This offering is not approved or endorsed by OpenCFD Limited,  |
|              producer and distributor of the OpenFOAM software via          |
|              www.openfoam.com, and owner of the OPENFOAM® and OpenCFD®      |
|              trade marks.                                                   |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      pd;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [1 -1 -2 0 0 0 0];

internalField   uniform 0;

boundaryField
{
    interface
    {
        type            zeroGradient;
        value           uniform 0;
    }

    inlet
    {
        type            zeroGradient;
    }
	
    outlet
    {
        type            zeroGradient;
    }

    symmetryXY
    {
        type         symmetry;
    }
    symmetryXZ
    {
        type         symmetry;
    }
    defaultFaces
    {
        type            empty;
    }
}

// ************************************************************************* //
