FSI/fluid-openfoam/0/phi
FoamFile
{
    version     2.0;
    format      ascii;
    class       surfaceScalarField;
    object      phi;
}

dimensions      [0 3 -1 0 0 0 0];

internalField   uniform 0;
boundaryField
{
    inlet
    {
        type            calculated;
        value           uniform 0;
    }
    outlet
    {
        type            calculated;
        value           uniform 0;
    }
    interface
    {
        type            calculated;
        value           uniform 0;
    }
    symmetryXY
    {
        type         symmetry;
		value           uniform 0;
    }
    symmetryXZ
    {
        type         symmetry;
		value           uniform 0;
    }

    defaultFaces
    {
        type            empty;
		value           uniform 0;
    }
}

// ************************************************************************* //
