FSI/fluid-openfoam/constant/transportProperties
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      transportProperties;
}

phases (water air);

water
{
    transportModel  Newtonian;
    nu              1.0e-03; // kinematic viscosity of mucus
    rho             1000;      // Density of mucus
}

air
{
    transportModel  Newtonian;
    nu              1.5e-05;  // Standard kinematic viscosity of air
    rho             1;         // Density of air
}

sigma               0.05; // Surface tension

// ************************************************************************* //
