FSI/fluid-openfoam/system/controlDict
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      controlDict;
}

application     interIsoFoam;       // latest OpenFOAM
// application     pimpleDyMFoam; // OpenFOAM v1712, OpenFOAM 5.x, or older

startFrom       startTime;

startTime       0;

stopAt          endTime;

endTime         0.05;

deltaT          0.000004;

writeControl    adjustableRunTime;

writeInterval   0.0005;

purgeWrite      0;

writeFormat     ascii;

writePrecision  6;

writeCompression off;

timeFormat      general;

timePrecision   6;

adjustTimeStep  no;

maxCo           0.1;
maxAlphaCo      0.1;
maxDeltaT       0.001;
minDeltaT       5e-7;

functions
{
    preCICE_Adapter
    {
       type preciceAdapterFunctionObject;
        libs ("libpreciceAdapterFunctionObject.so");
    }
 // wallShear_interface
  //{
   // type            wallShearStress;
   // libs            ("libfieldFunctionObjects.so"
   //                  "libincompressibleTurbulenceModels.so");
   // patches         (interface);
   // writeFields     yes;
  //}
//
  //dump_wss_alpha
  //{
    //type            surfaces;
    //libs            ("libsampling.so");
    //surfaceFormat   raw;        // csv not supported for surfaces in v2312
    //interpolate     true;       // maps alpha from volume to wall
    //fields          (wallShearStress alpha.water);
    //surfaces
    //(
      //iface
      //{
        //type        patch;
       // patches     (interface);   // your wall patch
       // triangulate false;         // stable face ordering
      //}
    //);
  //}
}
