FSI/fluid-openfoam/system/preciceDict
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      preciceDict;
}

preciceConfig "../precice-config.xml";

participant Fluid;

modules (FSI);

interfaces
{
  Interface1
  {
    mesh              Fluid-Mesh;
    patches           (interface);
    locations         faceCenters;
    
    readData
    (
      Displacement
    );
    
    writeData
    (
      Force
    );
  };
};

FSI
{
  rho rho [1 -3 0 0 0 0 0] 500;
  nu  nu [ 0 2 -1 0 0 0 0 ] 1.5e-05;
}
